soapRequest/getMusics.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:gs="http://spring.io/guides/gs-producing-web-service"
                  >
    <SOAP-ENV:Header>

    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <gs:getMusicsRequest/>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>



